ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
/*
    ChibiOS - Copyright (C) 2006-2026 Giovanni Di Sirio.

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    clocktree.h
 * @brief   Generated clock tree description header.
 *
 * @addtogroup CLOCKTREE
 * @{
 */
#ifndef CLOCKTREE_H
#define CLOCKTREE_H

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Dynamic clock point indexes and names
 * @{
 */
#define CLK_HSI16               0U
#define CLK_HSI48               1U
#define CLK_HSE                 2U
#define CLK_MSIS                3U
#define CLK_MSIK                4U
#define CLK_SYSCLK              5U
#define CLK_HCLK                6U
#define CLK_PCLK1               7U
#define CLK_PCLK1TIM            8U
#define CLK_PCLK2               9U
#define CLK_PCLK2TIM            10U
#define CLK_PCLK3               11U
#define CLK_MCO1                12U
#define CLK_MCO2                13U
#define CLK_ARRAY_SIZE          14U

#define CLK_POINT_NAMES                                                     \
  {                                                                         \
    "HSI16",                                                                \
    "HSI48",                                                                \
    "HSE",                                                                  \
    "MSIS",                                                                 \
    "MSIK",                                                                 \
    "SYSCLK",                                                               \
    "HCLK",                                                                 \
    "PCLK1",                                                                \
    "PCLK1TIM",                                                             \
    "PCLK2",                                                                \
    "PCLK2TIM",                                                             \
    "PCLK3",                                                                \
    "MCO1",                                                                 \
    "MCO2"                                                                  \
  }
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Clock tree configurations
 * @{
 */
/**
 * @brief   Enables dynamic clock handling.
 */
#if !defined(STM32_CFG_CLOCK_DYNAMIC) || defined(__DOXYGEN__)
  #define STM32_CFG_CLOCK_DYNAMIC           FALSE
#endif

/**
 * @brief   Selects the core voltage scaling range.
 */
#if !defined(STM32_CFG_PWR_VOSR) || defined(__DOXYGEN__)
  #define STM32_CFG_PWR_VOSR                PWR_VOSR_RANGE1
#endif

/**
 * @brief   Selects the MSIRC0 operating mode.
 */
#if !defined(STM32_CFG_MSIRC0_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIRC0_MODE             RCC_MSIRC0_PLL_LSE
#endif

/**
 * @brief   Selects the MSIRC1 operating mode.
 */
#if !defined(STM32_CFG_MSIRC1_MODE) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIRC1_MODE             RCC_MSIRC1_FREE
#endif

/**
 * @brief   Selects the MSIRC1 PLL correction factor.
 */
#if !defined(STM32_CFG_MSIPLL1N_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIPLL1N_VALUE          0
#endif

/**
 * @brief   Selects the source and divide factor for MSIS.
 */
#if !defined(STM32_CFG_MSIS_SRCDIV) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIS_SRCDIV             RCC_ICSCR1_MSIS_IRC0_DIV1
#endif

/**
 * @brief   Selects the source and divide factor for MSIK.
 */
#if !defined(STM32_CFG_MSIK_SRCDIV) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIK_SRCDIV             RCC_ICSCR1_MSIK_IRC0_DIV1
#endif

/**
 * @brief   Selects the system clock source after STOP mode.
 */
#if !defined(STM32_CFG_STOPWUCK) || defined(__DOXYGEN__)
  #define STM32_CFG_STOPWUCK                RCC_CFGR1_STOPWUCK_MSIS
#endif

/**
 * @brief   Selects the kernel clock source after STOP mode.
 */
#if !defined(STM32_CFG_STOPKERWUCK) || defined(__DOXYGEN__)
  #define STM32_CFG_STOPKERWUCK             RCC_CFGR1_STOPKERWUCK_MSIK
#endif

/**
 * @brief   Selects the MSI bias mode.
 */
#if !defined(STM32_CFG_MSIBIAS) || defined(__DOXYGEN__)
  #define STM32_CFG_MSIBIAS                 RCC_ICSCR1_MSIBIAS_CONTINUOUS
#endif

/**
 * @brief   Enables demand for the DAC1 sample-and-hold clock.
 */
#if !defined(STM32_CFG_DAC1SH_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_DAC1SH_REQUIRED         FALSE
#endif

/**
 * @brief   Enables demand for the LPTIM1 clock.
 */
#if !defined(STM32_CFG_LPTIM1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM1_REQUIRED         FALSE
#endif

/**
 * @brief   Enables demand for the LPTIM2 clock.
 */
#if !defined(STM32_CFG_LPTIM2_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM2_REQUIRED         FALSE
#endif

/**
 * @brief   Enables demand for the LPTIM3 and LPTIM4 clocks.
 */
#if !defined(STM32_CFG_LPTIM34_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM34_REQUIRED        FALSE
#endif

/**
 * @brief   Enables demand for the OCTOSPI clock.
 */
#if !defined(STM32_CFG_OCTOSPI_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_OCTOSPI_REQUIRED        FALSE
#endif

/**
 * @brief   Enables demand for the I3C1 clock.
 */
#if !defined(STM32_CFG_I3C1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_I3C1_REQUIRED           FALSE
#endif

/**
 * @brief   Enables demand for the I3C2 clock.
 */
#if !defined(STM32_CFG_I3C2_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_I3C2_REQUIRED           FALSE
#endif

/**
 * @brief   Enables demand for the SAI1 clock.
 */
#if !defined(STM32_CFG_SAI1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI1_REQUIRED           FALSE
#endif

/**
 * @brief   Enables demand for the ADF1 clock.
 */
#if !defined(STM32_CFG_ADF1_REQUIRED) || defined(__DOXYGEN__)
  #define STM32_CFG_ADF1_REQUIRED           FALSE
#endif

/**
 * @brief   Enables the HSI16 clock source.
 */
#if !defined(STM32_CFG_HSI16_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSI16_ENABLE            FALSE
#endif

/**
 * @brief   Enables the HSI48 clock source.
 */
#if !defined(STM32_CFG_HSI48_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSI48_ENABLE            FALSE
#endif

/**
 * @brief   Enables the HSE clock source.
 */
#if !defined(STM32_CFG_HSE_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_HSE_ENABLE              FALSE
#endif

/**
 * @brief   Enables the LSE clock source.
 */
#if !defined(STM32_CFG_LSE_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_LSE_ENABLE              FALSE
#endif

/**
 * @brief   Enables the LSI clock source.
 */
#if !defined(STM32_CFG_LSI_ENABLE) || defined(__DOXYGEN__)
  #define STM32_CFG_LSI_ENABLE              FALSE
#endif

/**
 * @brief   Selects the SYSCLK clock source.
 * @note    Allowed sources:
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 */
#if !defined(STM32_CFG_SYSCLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SYSCLK_SEL              RCC_CFGR1_SW_MSIS
#endif

/**
 * @brief   Configures the HCLK clock divider value.
 */
#if !defined(STM32_CFG_HCLK_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_HCLK_VALUE              1
#endif

/**
 * @brief   Configures the PCLK1 clock divider value.
 */
#if !defined(STM32_CFG_PCLK1_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK1_VALUE             1
#endif

/**
 * @brief   Configures the PCLK2 clock divider value.
 */
#if !defined(STM32_CFG_PCLK2_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK2_VALUE             1
#endif

/**
 * @brief   Configures the PCLK3 clock divider value.
 */
#if !defined(STM32_CFG_PCLK3_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_PCLK3_VALUE             1
#endif

/**
 * @brief   Selects the MCO1DIV clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - SYSCLK.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 *          - LSI.
 *          - LSE.
 *          - HSI48.
 *          - MSIK.
 */
#if !defined(STM32_CFG_MCO1DIV_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_MCO1DIV_SEL             RCC_CFGR1_MCO1SEL_OFF
#endif

/**
 * @brief   Configures the MCO1 clock divider value.
 */
#if !defined(STM32_CFG_MCO1_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_MCO1_VALUE              1
#endif

/**
 * @brief   Selects the MCO2DIV clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - SYSCLK.
 *          - MSIS.
 *          - HSI16.
 *          - HSE.
 *          - LSI.
 *          - LSE.
 *          - HSI48.
 *          - MSIK.
 */
#if !defined(STM32_CFG_MCO2DIV_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_MCO2DIV_SEL             RCC_CFGR1_MCO2SEL_OFF
#endif

/**
 * @brief   Configures the MCO2 clock divider value.
 */
#if !defined(STM32_CFG_MCO2_VALUE) || defined(__DOXYGEN__)
  #define STM32_CFG_MCO2_VALUE              1
#endif

/**
 * @brief   Selects the RTC clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - LSE.
 *          - LSI.
 *          - HSEDIV.
 */
#if !defined(STM32_CFG_RTC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_RTC_SEL                 RCC_BDCR_RTCSEL_NOCLOCK
#endif

/**
 * @brief   Selects the LSCO clock source.
 * @note    Allowed sources:
 *          - NONE.
 *          - LSI.
 *          - LSE.
 */
#if !defined(STM32_CFG_LSCO_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LSCO_SEL                RCC_BDCR_LSCOSEL_NOCLOCK
#endif

/**
 * @brief   Selects the USART1 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - HSI16.
 */
#if !defined(STM32_CFG_USART1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART1_SEL              RCC_CCIPR1_USART1SEL_PCLK2
#endif

/**
 * @brief   Selects the USART3 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - HSI16.
 */
#if !defined(STM32_CFG_USART3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USART3_SEL              RCC_CCIPR1_USART3SEL_PCLK1
#endif

/**
 * @brief   Selects the UART4 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - HSI16.
 */
#if !defined(STM32_CFG_UART4_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_UART4_SEL               RCC_CCIPR1_UART4SEL_PCLK1
#endif

/**
 * @brief   Selects the UART5 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - HSI16.
 */
#if !defined(STM32_CFG_UART5_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_UART5_SEL               RCC_CCIPR1_UART5SEL_PCLK1
#endif

/**
 * @brief   Selects the LPUART1 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - HSI16.
 *          - LSE.
 *          - MSIK.
 */
#if !defined(STM32_CFG_LPUART1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPUART1_SEL             RCC_CCIPR3_LPUART1SEL_PCLK3
#endif

/**
 * @brief   Selects the LPTIM1 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - LSI.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_LPTIM1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM1_SEL              RCC_CCIPR3_LPTIM1SEL_MSIK
#endif

/**
 * @brief   Selects the LPTIM2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - LSI.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_LPTIM2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM2_SEL              RCC_CCIPR1_LPTIM2SEL_PCLK1
#endif

/**
 * @brief   Selects the LPTIM34 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - LSI.
 *          - HSI16.
 *          - LSE.
 */
#if !defined(STM32_CFG_LPTIM34_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM34_SEL             RCC_CCIPR3_LPTIM34SEL_MSIK
#endif

/**
 * @brief   Selects the SPI1 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI1_SEL                RCC_CCIPR1_SPI1SEL_PCLK2
#endif

/**
 * @brief   Selects the SPI2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI2_SEL                RCC_CCIPR1_SPI2SEL_PCLK1
#endif

/**
 * @brief   Selects the SPI3 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI3_SEL                RCC_CCIPR2_SPI3SEL_PCLK1
#endif

/**
 * @brief   Selects the OCTOSPI clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - MSIK.
 */
#if !defined(STM32_CFG_OCTOSPI_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_OCTOSPI_SEL             RCC_CCIPR2_OCTOSPISEL_SYSCLK
#endif

/**
 * @brief   Selects the SYSTICK clock source.
 * @note    Allowed sources:
 *          - HCLKDIV8.
 *          - LSI.
 *          - LSE.
 */
#if !defined(STM32_CFG_SYSTICK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SYSTICK_SEL             RCC_CCIPR1_SYSTICKSEL_HCLKDIV8
#endif

/**
 * @brief   Selects the ICLK clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - MSIK.
 *          - HSE.
 *          - SYSCLK.
 */
#if !defined(STM32_CFG_ICLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ICLK_SEL                RCC_CCIPR1_ICLKSEL_SYSCLK
#endif

/**
 * @brief   Selects the USB clock source.
 * @note    Allowed sources:
 *          - ICLK.
 *          - ICLKDIV2.
 */
#if !defined(STM32_CFG_USB_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_USB_SEL                 RCC_CCIPR1_USB1SEL_ICLKDIV2
#endif

/**
 * @brief   Selects the I2C1 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C1_SEL                RCC_CCIPR1_I2C1SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C2_SEL                RCC_CCIPR1_I2C2SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C3 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C3_SEL                RCC_CCIPR3_I2C3SEL_PCLK3
#endif

/**
 * @brief   Selects the I3C1 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I3C1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I3C1_SEL                RCC_CCIPR1_I3C1SEL_PCLK1
#endif

/**
 * @brief   Selects the I3C2 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I3C2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I3C2_SEL                RCC_CCIPR1_I3C2SEL_PCLK3
#endif

/**
 * @brief   Selects the ADCDAC clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - HSE.
 *          - MSIK.
 */
#if !defined(STM32_CFG_ADCDAC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADCDAC_SEL              RCC_CCIPR2_ADCDACSEL_HCLK
#endif

/**
 * @brief   Selects the DAC1SH clock source.
 * @note    Allowed sources:
 *          - LSE.
 *          - LSI.
 */
#if !defined(STM32_CFG_DAC1SH_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_DAC1SH_SEL              RCC_CCIPR2_DAC1SHSEL_LSE
#endif

/**
 * @brief   Selects the RNG clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - MSIK.
 */
#if !defined(STM32_CFG_RNG_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_RNG_SEL                 RCC_CCIPR2_RNGSEL_MSIK
#endif

/**
 * @brief   Selects the FDCAN1 clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - MSIK.
 */
#if !defined(STM32_CFG_FDCAN1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_FDCAN1_SEL              RCC_CCIPR1_FDCAN1SEL_SYSCLK
#endif

/**
 * @brief   Selects the SAI1 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - AUDIOCLK.
 *          - HSE.
 */
#if !defined(STM32_CFG_SAI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI1_SEL                RCC_CCIPR2_SAI1SEL_MSIK
#endif

/**
 * @brief   Selects the ADF1 clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - AUDIOCLK.
 *          - HSE.
 *          - SAI1.
 */
#if !defined(STM32_CFG_ADF1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADF1_SEL                RCC_CCIPR2_ADF1SEL_HCLK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/**
 * @name    Clock point derived constants and checks
 * @{
 */
/*
 * Extra configuration checks.
 */
#if !defined(TRUE) && !defined(__DOXYGEN__)
  #error "TRUE not defined"
#endif
#if !defined(FALSE) && !defined(__DOXYGEN__)
  #error "FALSE not defined"
#endif
#if !((STM32_CFG_CLOCK_DYNAMIC == TRUE) || (STM32_CFG_CLOCK_DYNAMIC == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_CLOCK_DYNAMIC value specified"
#endif

#if !defined(PWR_VOSR_RANGE1) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_RANGE1 not defined"
#endif
#if !defined(PWR_VOSR_RANGE2) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_RANGE2 not defined"
#endif
#if !((STM32_CFG_PWR_VOSR == PWR_VOSR_RANGE1) ||                            \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_RANGE2)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PWR_VOSR value specified"
#endif

#if !defined(RCC_MSIRC0_FREE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC0_FREE not defined"
#endif
#if !defined(RCC_MSIRC0_PLL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC0_PLL_LSE not defined"
#endif
#if !defined(RCC_MSIRC0_PLL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC0_PLL_HSE not defined"
#endif
#if !defined(RCC_MSIRC0_PLL_LSE_FAST) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC0_PLL_LSE_FAST not defined"
#endif
#if !defined(RCC_MSIRC0_PLL_HSE_FAST) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC0_PLL_HSE_FAST not defined"
#endif
#if !((STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_FREE) ||                         \
     (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) ||                       \
     (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE) ||                       \
     (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST) ||                  \
     (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE_FAST)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIRC0_MODE value specified"
#endif

#if !defined(RCC_MSIRC1_FREE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC1_FREE not defined"
#endif
#if !defined(RCC_MSIRC1_PLL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC1_PLL_LSE not defined"
#endif
#if !defined(RCC_MSIRC1_PLL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC1_PLL_HSE not defined"
#endif
#if !defined(RCC_MSIRC1_PLL_LSE_FAST) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC1_PLL_LSE_FAST not defined"
#endif
#if !defined(RCC_MSIRC1_PLL_HSE_FAST) && !defined(__DOXYGEN__)
  #error "RCC_MSIRC1_PLL_HSE_FAST not defined"
#endif
#if !((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_FREE) ||                         \
     (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) ||                       \
     (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) ||                       \
     (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) ||                  \
     (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIRC1_MODE value specified"
#endif

#if !((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1) || \
     (STM32_CFG_MSIPLL1N_VALUE == 2) || (STM32_CFG_MSIPLL1N_VALUE == 3)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIPLL1N_VALUE value specified"
#endif

#if !defined(RCC_ICSCR1_MSIS_IRC0_DIV1) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC0_DIV1 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC0_DIV2) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC0_DIV2 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC0_DIV4) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC0_DIV4 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC0_DIV8) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC0_DIV8 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC1_DIV1) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC1_DIV1 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC1_DIV2) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC1_DIV2 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC1_DIV4) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC1_DIV4 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIS_IRC1_DIV8) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIS_IRC1_DIV8 not defined"
#endif
#if !((STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV1) ||               \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV2) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV4) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC0_DIV8) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV1) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV2) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV4) ||                \
     (STM32_CFG_MSIS_SRCDIV == RCC_ICSCR1_MSIS_IRC1_DIV8)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIS_SRCDIV value specified"
#endif

#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV1) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV1 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV2) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV2 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV4) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV4 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC0_DIV8) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC0_DIV8 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV1) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV1 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV2) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV2 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV4) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV4 not defined"
#endif
#if !defined(RCC_ICSCR1_MSIK_IRC1_DIV8) && !defined(__DOXYGEN__)
  #error "RCC_ICSCR1_MSIK_IRC1_DIV8 not defined"
#endif
#if !((STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV1) ||               \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV2) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV4) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC0_DIV8) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV1) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV2) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV4) ||                \
     (STM32_CFG_MSIK_SRCDIV == RCC_ICSCR1_MSIK_IRC1_DIV8)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIK_SRCDIV value specified"
#endif

