ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#if !((STM32_PCLK1_ENABLED != TRUE) || (STM32_PCLK1_FREQ <= STM32_PCLK1_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PCLK1_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the PCLK1TIM clock point. ----------------------*/

/**
 * @brief   PCLK1TIM clock register bits.
 */
#if (STM32_PCLK1TIM_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK1TIM_BITS               0U
#else
  #define STM32_PCLK1TIM_BITS               0U
#endif

/**
 * @brief   APB1 timer clock clock point.
 */
#if (STM32_PCLK1TIM_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK1TIM_FREQ               ((STM32_CFG_PCLK1_VALUE == 1) ? STM32_PCLK1_FREQ : \
                                             (STM32_PCLK1_FREQ * 2U))
#else
  #define STM32_PCLK1TIM_FREQ               0U
#endif

/*--- Macros and checks for the PCLK2 clock point. -------------------------*/

/**
 * @brief   PCLK2 clock register bits.
 */
#if (STM32_CFG_PCLK2_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK2_BITS                RCC_CFGR2_PPRE2_DIV1
  #else
    #define STM32_PCLK2_BITS                0U
  #endif
#elif (STM32_CFG_PCLK2_VALUE == 2)
  #if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK2_BITS                RCC_CFGR2_PPRE2_DIV2
  #else
    #define STM32_PCLK2_BITS                0U
  #endif
#elif (STM32_CFG_PCLK2_VALUE == 4)
  #if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK2_BITS                RCC_CFGR2_PPRE2_DIV4
  #else
    #define STM32_PCLK2_BITS                0U
  #endif
#elif (STM32_CFG_PCLK2_VALUE == 8)
  #if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK2_BITS                RCC_CFGR2_PPRE2_DIV8
  #else
    #define STM32_PCLK2_BITS                0U
  #endif
#elif (STM32_CFG_PCLK2_VALUE == 16)
  #if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK2_BITS                RCC_CFGR2_PPRE2_DIV16
  #else
    #define STM32_PCLK2_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_PCLK2_VALUE value specified"
#endif

/**
 * @brief   APB2 clock clock point.
 */
#if (STM32_PCLK2_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK2_FREQ                  (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK2_VALUE)
#else
  #define STM32_PCLK2_FREQ                  0U
#endif

#if !((STM32_PCLK2_ENABLED != TRUE) || (STM32_PCLK2_FREQ <= STM32_PCLK2_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PCLK2_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the PCLK2TIM clock point. ----------------------*/

/**
 * @brief   PCLK2TIM clock register bits.
 */
#if (STM32_PCLK2TIM_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK2TIM_BITS               0U
#else
  #define STM32_PCLK2TIM_BITS               0U
#endif

/**
 * @brief   APB2 timer clock clock point.
 */
#if (STM32_PCLK2TIM_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK2TIM_FREQ               ((STM32_CFG_PCLK2_VALUE == 1) ? STM32_PCLK2_FREQ : \
                                             (STM32_PCLK2_FREQ * 2U))
#else
  #define STM32_PCLK2TIM_FREQ               0U
#endif

/*--- Macros and checks for the PCLK3 clock point. -------------------------*/

/**
 * @brief   PCLK3 clock register bits.
 */
#if (STM32_CFG_PCLK3_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK3_BITS                RCC_CFGR3_PPRE3_DIV1
  #else
    #define STM32_PCLK3_BITS                0U
  #endif
#elif (STM32_CFG_PCLK3_VALUE == 2)
  #if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK3_BITS                RCC_CFGR3_PPRE3_DIV2
  #else
    #define STM32_PCLK3_BITS                0U
  #endif
#elif (STM32_CFG_PCLK3_VALUE == 4)
  #if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK3_BITS                RCC_CFGR3_PPRE3_DIV4
  #else
    #define STM32_PCLK3_BITS                0U
  #endif
#elif (STM32_CFG_PCLK3_VALUE == 8)
  #if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK3_BITS                RCC_CFGR3_PPRE3_DIV8
  #else
    #define STM32_PCLK3_BITS                0U
  #endif
#elif (STM32_CFG_PCLK3_VALUE == 16)
  #if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PCLK3_BITS                RCC_CFGR3_PPRE3_DIV16
  #else
    #define STM32_PCLK3_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_PCLK3_VALUE value specified"
#endif

/**
 * @brief   APB3 clock clock point.
 */
#if (STM32_PCLK3_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PCLK3_FREQ                  (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK3_VALUE)
#else
  #define STM32_PCLK3_FREQ                  0U
#endif

#if !((STM32_PCLK3_ENABLED != TRUE) || (STM32_PCLK3_FREQ <= STM32_PCLK3_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PCLK3_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the HSEDIV clock point. ------------------------*/

/**
 * @brief   HSEDIV clock register bits.
 */
#if (STM32_HSEDIV_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSEDIV_BITS                 0U
#else
  #define STM32_HSEDIV_BITS                 0U
#endif

/**
 * @brief   HSE divided clock clock point.
 */
#if (STM32_HSEDIV_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSEDIV_FREQ                 (STM32_HSE_FREQ / 32U)
#else
  #define STM32_HSEDIV_FREQ                 0U
#endif

/*--- Macros and checks for the HCLKDIV8 clock point. ----------------------*/

/**
 * @brief   HCLKDIV8 clock register bits.
 */
#if (STM32_HCLKDIV8_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HCLKDIV8_BITS               0U
#else
  #define STM32_HCLKDIV8_BITS               0U
#endif

/**
 * @brief   HCLK divided by 8 clock point.
 */
#if (STM32_HCLKDIV8_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HCLKDIV8_FREQ               (hal_lld_get_clock_point(CLK_HCLK) / \
                                             8U)
#else
  #define STM32_HCLKDIV8_FREQ               0U
#endif

/*--- Macros and checks for the MCO1DIV clock point. -----------------------*/

/**
 * @brief   MCO1DIV clock register bits.
 */
#if (STM32_MCO1DIV_ENABLED == FALSE)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_OFF
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_OFF) || defined(__DOXYGEN__)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_OFF
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_SYSCLK)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_SYSCLK
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIS)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_MSIS
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSI16)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_HSI16
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSE)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_HSE
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSI)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_LSI
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSE)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_LSE
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSI48)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_HSI48
#elif (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIK)
  #define STM32_MCO1DIV_BITS                RCC_CFGR1_MCO1SEL_MSIK
#else
  #error "invalid STM32_CFG_MCO1DIV_SEL value specified"
#endif

/**
 * @brief   MCO1 selected source before prescaler clock point.
 */
#if ((STM32_MCO1DIV_ENABLED == TRUE) && \
     (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_OFF)) || \
    defined(__DOXYGEN__)
  #define STM32_MCO1DIV_FREQ                STM32_NONE_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_SYSCLK)
  #define STM32_MCO1DIV_FREQ                STM32_SYSCLK_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIS)
  #define STM32_MCO1DIV_FREQ                STM32_MSIS_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSI16)
  #define STM32_MCO1DIV_FREQ                STM32_HSI16_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSE)
  #define STM32_MCO1DIV_FREQ                STM32_HSE_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSI)
  #define STM32_MCO1DIV_FREQ                STM32_LSI_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSE)
  #define STM32_MCO1DIV_FREQ                STM32_LSE_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSI48)
  #define STM32_MCO1DIV_FREQ                STM32_HSI48_FREQ
#elif (STM32_MCO1DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_MSIK)
  #define STM32_MCO1DIV_FREQ                STM32_MSIK_FREQ
#else
  #define STM32_MCO1DIV_FREQ                0U
#endif

/*--- Macros and checks for the MCO1 clock point. --------------------------*/

/**
 * @brief   MCO1 clock register bits.
 */
#if (STM32_CFG_MCO1_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV1
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 2)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV2
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 4)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV4
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 8)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV8
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 16)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV16
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 32)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV32
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 64)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV64
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#elif (STM32_CFG_MCO1_VALUE == 128)
  #if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO1_BITS                 RCC_CFGR1_MCO1PRE_DIV128
  #else
    #define STM32_MCO1_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_MCO1_VALUE value specified"
#endif

/**
 * @brief   MCO1 output pin clock point.
 */
#if (STM32_MCO1_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_MCO1_FREQ                   (STM32_MCO1DIV_FREQ /           \
                                             STM32_CFG_MCO1_VALUE)
#else
  #define STM32_MCO1_FREQ                   0U
#endif

/*--- Macros and checks for the MCO2DIV clock point. -----------------------*/

/**
 * @brief   MCO2DIV clock register bits.
 */
#if (STM32_MCO2DIV_ENABLED == FALSE)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_OFF
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_OFF) || defined(__DOXYGEN__)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_OFF
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_SYSCLK)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_SYSCLK
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIS)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_MSIS
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSI16)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_HSI16
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSE)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_HSE
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSI)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_LSI
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSE)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_LSE
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSI48)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_HSI48
#elif (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIK)
  #define STM32_MCO2DIV_BITS                RCC_CFGR1_MCO2SEL_MSIK
#else
  #error "invalid STM32_CFG_MCO2DIV_SEL value specified"
#endif

/**
 * @brief   MCO2 selected source before prescaler clock point.
 */
#if ((STM32_MCO2DIV_ENABLED == TRUE) && \
     (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_OFF)) || \
    defined(__DOXYGEN__)
  #define STM32_MCO2DIV_FREQ                STM32_NONE_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_SYSCLK)
  #define STM32_MCO2DIV_FREQ                STM32_SYSCLK_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIS)
  #define STM32_MCO2DIV_FREQ                STM32_MSIS_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSI16)
  #define STM32_MCO2DIV_FREQ                STM32_HSI16_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSE)
  #define STM32_MCO2DIV_FREQ                STM32_HSE_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSI)
  #define STM32_MCO2DIV_FREQ                STM32_LSI_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSE)
  #define STM32_MCO2DIV_FREQ                STM32_LSE_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSI48)
  #define STM32_MCO2DIV_FREQ                STM32_HSI48_FREQ
#elif (STM32_MCO2DIV_ENABLED == TRUE) && \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_MSIK)
  #define STM32_MCO2DIV_FREQ                STM32_MSIK_FREQ
#else
  #define STM32_MCO2DIV_FREQ                0U
#endif

/*--- Macros and checks for the MCO2 clock point. --------------------------*/

/**
 * @brief   MCO2 clock register bits.
 */
#if (STM32_CFG_MCO2_VALUE == 1) || defined(__DOXYGEN__)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV1
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 2)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV2
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 4)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV4
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 8)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV8
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 16)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV16
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 32)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV32
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 64)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV64
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#elif (STM32_CFG_MCO2_VALUE == 128)
  #if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MCO2_BITS                 RCC_CFGR1_MCO2PRE_DIV128
  #else
    #define STM32_MCO2_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_MCO2_VALUE value specified"
#endif

/**
 * @brief   MCO2 output pin clock point.
 */
#if (STM32_MCO2_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_MCO2_FREQ                   (STM32_MCO2DIV_FREQ /           \
                                             STM32_CFG_MCO2_VALUE)
#else
  #define STM32_MCO2_FREQ                   0U
#endif

/*--- Macros and checks for the RTC clock point. ---------------------------*/

/**
 * @brief   RTC clock register bits.
 */
#if (STM32_RTC_ENABLED == FALSE)
  #define STM32_RTC_BITS                    RCC_BDCR_RTCSEL_NOCLOCK
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_RTC_BITS                    RCC_BDCR_RTCSEL_NOCLOCK
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSE)
  #define STM32_RTC_BITS                    RCC_BDCR_RTCSEL_LSE
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSI)
  #define STM32_RTC_BITS                    RCC_BDCR_RTCSEL_LSI
#elif (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_HSEDIV)
  #define STM32_RTC_BITS                    RCC_BDCR_RTCSEL_HSEDIV
#else
  #error "invalid STM32_CFG_RTC_SEL value specified"
#endif

/**
 * @brief   RTC clock clock point.
 */
#if ((STM32_RTC_ENABLED == TRUE) && \
     (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_RTC_FREQ                    STM32_NONE_FREQ
#elif (STM32_RTC_ENABLED == TRUE) && \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSE)
  #define STM32_RTC_FREQ                    STM32_LSE_FREQ
#elif (STM32_RTC_ENABLED == TRUE) && \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSI)
  #define STM32_RTC_FREQ                    STM32_LSI_FREQ
#elif (STM32_RTC_ENABLED == TRUE) && \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_HSEDIV)
  #define STM32_RTC_FREQ                    STM32_HSEDIV_FREQ
#else
  #define STM32_RTC_FREQ                    0U
#endif

/*--- Macros and checks for the LSCO clock point. --------------------------*/

/**
 * @brief   LSCO clock register bits.
 */
#if (STM32_LSCO_ENABLED == FALSE)
  #define STM32_LSCO_BITS                   RCC_BDCR_LSCOSEL_NOCLOCK
#elif (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_LSCO_BITS                   RCC_BDCR_LSCOSEL_NOCLOCK
#elif (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSI)
  #define STM32_LSCO_BITS                   RCC_BDCR_LSCOSEL_LSI
#elif (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSE)
  #define STM32_LSCO_BITS                   RCC_BDCR_LSCOSEL_LSE
#else
  #error "invalid STM32_CFG_LSCO_SEL value specified"
#endif

/**
 * @brief   LSCO output pin clock point.
 */
#if ((STM32_LSCO_ENABLED == TRUE) && \
     (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_LSCO_FREQ                   STM32_NONE_FREQ
#elif (STM32_LSCO_ENABLED == TRUE) && \
      (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSI)
  #define STM32_LSCO_FREQ                   STM32_LSI_FREQ
#elif (STM32_LSCO_ENABLED == TRUE) && \
      (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSE)
  #define STM32_LSCO_FREQ                   STM32_LSE_FREQ
#else
  #define STM32_LSCO_FREQ                   0U
#endif

/*--- Macros and checks for the USART1 clock point. ------------------------*/

/**
 * @brief   USART1 clock register bits.
 */
#if (STM32_CFG_USART1_SEL == RCC_CCIPR1_USART1SEL_PCLK2) || defined(__DOXYGEN__)
  #define STM32_USART1_BITS                 RCC_CCIPR1_USART1SEL_PCLK2
#elif (STM32_CFG_USART1_SEL == RCC_CCIPR1_USART1SEL_HSI16)
  #define STM32_USART1_BITS                 RCC_CCIPR1_USART1SEL_HSI16
#else
  #error "invalid STM32_CFG_USART1_SEL value specified"
#endif

/**
 * @brief   USART1 clock clock point.
 */
#if ((STM32_USART1_ENABLED == TRUE) && \
     (STM32_CFG_USART1_SEL == RCC_CCIPR1_USART1SEL_PCLK2)) || \
    defined(__DOXYGEN__)
  #define STM32_USART1_FREQ                 STM32_PCLK2_FREQ
#elif (STM32_USART1_ENABLED == TRUE) && \
      (STM32_CFG_USART1_SEL == RCC_CCIPR1_USART1SEL_HSI16)
  #define STM32_USART1_FREQ                 STM32_HSI16_FREQ
#else
  #define STM32_USART1_FREQ                 0U
#endif

